{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "T5ForConditionalGeneration",
    "parent_library": "transformers.models.t5.modeling_t5"
  },
  "base_model_name_or_path": "t5-large",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": "gaussian",
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "v",
    "q",
    "k"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}